---

C#Visual BasicVisual C++

Revit 2024 API
---
CurveArrArray..::..Item Property
CurveArrArray Class See Also Send Feedback
---

Gets or sets an item at a specified index within the array.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual CurveArray this[
    	int index
    ] { get; set; }

Visual Basic
---

    Public Overridable Property Item ( _
    	index As Integer _
    ) As CurveArray
    	Get
    	Set

Visual C++
---

    public:
    virtual property CurveArray^ Item[int index] {
    	CurveArray^ get (int index);
    	void set (int index, CurveArray^ value);
    }

#### Parameters

index
    Type: System..::..Int32The index of the item to be set or retrieved.

#### Return Value

Returns the object at the specified index.

# See Also

CurveArrArray Class

Autodesk.Revit.DB Namespace